/*
	
	
	良好编程风格准则(不断更新ing) 
	
	1.预处理器指令与尖括号之间空一格:  
		#include <stdio.h>
	2.逗号右边空一格，左边不空:
		int a, b, c;
	3.运算符左右空一格:
		int a = 4, b = 3 + 6;
	4.凡是花括号内语句一律tab缩进，循环体的执行语句默认缩进:
		{
			int i;
			for (i = 0; i < 5; ++i)
				printf("%d", i + 1);
			printf（"\n");
		}
	5.for和while与括号之间空一格:
		for (...)
		while (...)
	6.数组名和中括号是连体的、函数名和括号是连体的:
		int nums[8];
		nums[7] = 5;
		printf("%d",nums[7]);
	7.不要使用多余的中间变量:
		a = num % 10;
		b = 100 * a;
		c = num / 10;
		num = b + c;
		//你搞那么多中间变量不晕死才怪，下面是合理做法 
		num = num % 10 * 100 + num / 10;  
	8.最后一句输出得添上换行符，实在不行就单独弄一句:
		printf("\n");
		//或者
		puts("");
*/ 
	
