#include <stdio.h>

int main()
{
	int a = 3, b = 5;
	int * p = &a;
	int ** pp = &p;	
	printf("**pp = %d\n", **pp);
	printf(" *pp = %p\n", *pp);
	printf("  pp = %p\n", pp);
	printf(" &pp = %p\n\n", &pp);
	
	printf("  *p = %d\n", *p);
	printf("   p = %p\n", p);
	printf("  &p = %p\n\n", &p);
	 
	printf("   a = %d\n", a);
	printf("  &a = %p\n\n", &a);
	
	*pp = &b;	//对pp解除引用后就是访问指针p了，然后对其赋b的地址进行修改，然后p的值就是&b
	printf("修改pp指向的指针p后：\n");
	printf("**pp = %d\n", **pp); 
	printf(" *pp = %p\n", *pp);
	printf("  &b = %p\n\n", &b);
	
	**pp = 8;
	printf("修改pp指向的指针p指向的变量b后： \n");
	printf("**pp = %d\n", **pp);
	printf("   b = %d\n", b);
	return 0;
}

/*
	简单变量声明时，你可以在其作用域内修改变量的值，但不能改变它所在的地址；简单变量作为参数时，不能修改原变量的值 
	
	指针的声明使得你可以访问变量(或数组)，并且能修改指向变量(或数组)的值，更可以改变指针所存的地址值；
指针作为参数时，不能修改原指针的地址值，但可以修改指向变量(或数组)的值。 
	
	但如果我们想要在别的函数修改指针所存的地址值，我们需要用二重指针
	
	二重指针的声明：
	如 int ** a;		//这是一个int二重指针
	   double ** b;		//这是一个double二重指针
	
	二重指针的赋值： 
	int a = 3;
	int * b = &a;
	int ** c = &a;		//错误！二重指针应接受指针所在的地址值
	int ** d = &&a;		//错误！对地址不能取地址
	int ** e = c;		//正确，同种类型可以赋值 
	 
	二重指针的解除引用：
	int a = 3, b = 5;
	int * c = &a, *d = &b;
	int ** e = &c;		
	//	e解除一次引用后为*e，即为指针c保存的地址值，即&a
	//  e解除两次引用后为**e，即变量a的值
	// **e = 4;		//对变量a的值修改为4
	// *e = &b;		//指针c原来指向变量a，现在指向变量b
	// e = &d;		//二重指针e指向了指针d  
	
	二重指针的声明使得你可以修改指针所指物、指针所指物的值；
二重指针作为参数时，可以修改原指针的地址值以及修改指针所指物的值

	总之，多一层间接的关系(指针*越多)，可以访问的权限(能力)也就越高
	
	二重指针关系图：
	int a = 4;
	int * b = &a;
	int ** c = &b;
	
   **c  --------------------> *b --------------------> a [    4   ] 
	*c  0x00001000 --------->  b [0x00001000] ------> &a 0x00001000
	 c [0x00001004]------->   &b  0x00001004 
	&c  0x00001008 
*/
