#include <stdio.h>
#include <stdlib.h>

int main()
{
	int i, m, n;
	printf("输入m: ");
	scanf("%d", &m);
	
	//---------------------------------------------------------------------- 
	//情况一：固定第二维度，创建出来的动态数组内存必然是连续的 
	int (*p1)[4] = (int (*)[4])malloc(sizeof (int) * 4 * m);	//p1[m][4]
	//---------------------------------------------------------------------- 
	
	for (i = 0;i < m;++i)
		printf("p1[%d]地址: %p\n", i, p1[i]);
	
	
	printf("输入m n:");
	scanf("%d%d", &m, &n);
	//---------------------------------------------------------------------------- 
	//情况二：两个维度未知，首先需要声明二重指针，确定指针元素个数，然后对每个指针
	//			内存分配，这样声明出来的动态数组内存不一定连续
	//			如p2[4][5]的数组，p2[2][4]和p2[3][0]就不一定连续 
	int ** p2 = (int **)malloc(sizeof (int *) * m);
	for (i = 0;i < m;++i)
		p2[i] = (int *)malloc(sizeof (int) * n);	//为每一个指针开辟新内存 
	//---------------------------------------------------------------------------- 
	
	for (i = 0;i < m;++i)
		printf("p2[%d]地址: %p\n", i, p1[i]);
		
	//情况二释放内存： 
	for (i = 0;i < m; ++i)	//为每一个指针释放内存 
		free(p2[i]);
	free(p2);				//释放p2的指针数组 
	
	//情况一释放内存： 
	free(p1);
					
	return 0; 
}
