//表达式(expression) 是由运算符和操作数组合构成的，甚至是有返回值的函数
//比如：
/*
	4
	-5
	3+4
	a*(b+c/d)-e
	q = 5 * 2
	sqrt(5) + 5
	q > 3
*/
/*每一个表达式一定有一个结果值(int x = 5,y = 5;) 
		表达式					结果值
		3 + 4					  7
		q = 5 * 2				  10
		sqrt(9)					  3
		5 > 3					  1(true)
		5 < 3					  0(false) 
		x++ 					  5
		++y						  6	
		(4, 5)					  5
	
		注意:int a 不是一个表达式，也没有值 
*/
	
//语句(statement) 是构造程序的基本成分，一个程序包含着1条乃至上百万条的语句
//一般语句都是以分号结尾的，例如： 
/*
	   ;   	//空语句
	   int q;		//声明语句 
	   q = 5 * 2; 	//赋值语句
	   printf("Hello World");		//函数调用语句 
	   
  ...后面还会讲到有循环语句、条件语句和复合语句 
*/			 

/*目前已学的运算符包括:
	+ - * / % & = ++ -- sizeof ,
*/ 
		 

